even-better-server/app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "rollin@gaylordkuvalis.info"], ["LIMIT", 1]]
---
  def authenticate
    auth_token =
      AuthenticateUser.new(auth_params[:email], auth_params[:password]).call
    user = User.find_by(email: auth_params[:email])