even-better-server/app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$04$0YSX07dEgmxRSf3vsPk9buQgiO9qt.lpHNGRfexNsDwxO9XaD2xUa"], ["created_at", "2017-10-22 16:46:01.647038"], ["updated_at", "2017-10-22 16:46:01.647038"]]
---
  def create
    binding.pry
    user = User.create!(user_params)